niclash/forthright/arch/esp8266/spiffs/spiffs_nucleus.c

#include "spiffs.h"
#include "spiffs_nucleus.h"

static int32_t spiffs_page_data_check(spiffs *fs, spiffs_fd *fd, spiffs_page_ix pix, spiffs_span_ix spix) {
    int32_t res = SPIFFS_OK;
    if (pix == (spiffs_page_ix) -1) {
        // referring to page 0xffff...., bad object index
        return SPIFFS_ERR_INDEX_REF_FREE;
    }
    if (pix % SPIFFS_PAGES_PER_BLOCK(fs) < SPIFFS_OBJ_LOOKUP_PAGES(fs)) {
        // referring to an object lookup page, bad object index
        return SPIFFS_ERR_INDEX_REF_LU;
    }
    if (pix > SPIFFS_MAX_PAGES(fs)) {
        // referring to a bad page
        return SPIFFS_ERR_INDEX_REF_INVALID;
    }
#if SPIFFS_PAGE_CHECK
    spiffs_page_header ph;
    res = _spiffs_rd(
            fs, SPIFFS_OP_T_OBJ_DA | SPIFFS_OP_C_READ,
            fd->file_nbr,
            SPIFFS_PAGE_TO_PADDR(fs, pix),
            sizeof(spiffs_page_header),
            (uint8_t *) &ph);
    SPIFFS_CHECK_RES(res);
    SPIFFS_VALIDATE_DATA(ph, fd->obj_id & ~SPIFFS_OBJ_ID_IX_FLAG, spix);
#endif
    return res;
}

static int32_t spiffs_page_index_check(spiffs *fs, spiffs_fd *fd, spiffs_page_ix pix, spiffs_span_ix spix) {
    int32_t res = SPIFFS_OK;
    if (pix == (spiffs_page_ix) -1) {
        // referring to page 0xffff...., bad object index
        return SPIFFS_ERR_INDEX_FREE;
    }
    if (pix % SPIFFS_PAGES_PER_BLOCK(fs) < SPIFFS_OBJ_LOOKUP_PAGES(fs)) {
        // referring to an object lookup page, bad object index
        return SPIFFS_ERR_INDEX_LU;
    }
    if (pix > SPIFFS_MAX_PAGES(fs)) {
        // referring to a bad page
        return SPIFFS_ERR_INDEX_INVALID;
    }
#if SPIFFS_PAGE_CHECK
    spiffs_page_header ph;
    res = _spiffs_rd(
            fs, SPIFFS_OP_T_OBJ_IX | SPIFFS_OP_C_READ,
            fd->file_nbr,
            SPIFFS_PAGE_TO_PADDR(fs, pix),
            sizeof(spiffs_page_header),
            (uint8_t *) &ph);
    SPIFFS_CHECK_RES(res);
    SPIFFS_VALIDATE_OBJIX(ph, fd->obj_id, spix);
#endif
    return res;
}

#if !SPIFFS_CACHE

int32_t spiffs_phys_rd(
    spiffs *fs,
    u32_t addr,
    u32_t len,
    uint8_t *dst) {
  return fs->cfg.hal_read_f(addr, len, dst);
}

int32_t spiffs_phys_wr(
    spiffs *fs,
    u32_t addr,
    u32_t len,
    uint8_t *src) {
  return fs->cfg.hal_write_f(addr, len, src);
}

#endif

int32_t spiffs_phys_cpy(
        spiffs *fs,
        spiffs_file fh,
        u32_t dst,
        u32_t src,
        u32_t len) {
    int32_t res;
    uint8_t b[SPIFFS_COPY_BUFFER_STACK];
    while (len > 0) {
        u32_t chunk_size = MIN(SPIFFS_COPY_BUFFER_STACK, len);
        res = _spiffs_rd(fs, SPIFFS_OP_T_OBJ_DA | SPIFFS_OP_C_MOVS, fh, src, chunk_size, b);
        SPIFFS_CHECK_RES(res);
        res = _spiffs_wr(fs, SPIFFS_OP_T_OBJ_DA | SPIFFS_OP_C_MOVD, fh, dst, chunk_size, b);
        SPIFFS_CHECK_RES(res);
        len -= chunk_size;
        src += chunk_size;
        dst += chunk_size;
    }
    return SPIFFS_OK;
}

// Find object lookup entry containing given id with visitor.
// Iterate over object lookup pages in each block until a given object id entry is found.
// When found, the visitor function is called with block index, entry index and user_data.
// If visitor returns SPIFFS_VIS_CONTINUE, the search goes on. Otherwise, the search will be
// ended and visitor's return code is returned to caller.
// If no visitor is given (0) the search returns on first entry with matching object id.
// If no match is found in all look up, SPIFFS_VIS_END is returned.
// @param fs                    the file system
// @param starting_block        the starting block to start search in
// @param starting_lu_entry     the look up index entry to start search in
// @param flags                 ored combination of SPIFFS_VIS_CHECK_ID, SPIFFS_VIS_CHECK_PH,
//                              SPIFFS_VIS_NO_WRAP
// @param obj_id                argument object id
// @param v                     visitor callback function
// @param user_data             any data, passed to the callback visitor function
// @param user_p                any pointer, passed to the callback visitor function
// @param block_ix              reported block index where match was found
// @param lu_entry              reported look up index where match was found
int32_t spiffs_obj_lu_find_entry_visitor(
        spiffs *fs,
        spiffs_block_ix starting_block,
        int starting_lu_entry,
        uint8_t flags,
        spiffs_obj_id obj_id,
        spiffs_visitor_f v,
        u32_t user_data,
        void *user_p,
        spiffs_block_ix *block_ix,
        int *lu_entry) {
    int32_t res = SPIFFS_OK;
    int32_t entry_count = fs->block_count * SPIFFS_OBJ_LOOKUP_MAX_ENTRIES(fs);
    spiffs_block_ix cur_block = starting_block;
    u32_t cur_block_addr = starting_block * SPIFFS_CFG_LOG_BLOCK_SZ(fs);

    spiffs_obj_id *obj_lu_buf = (spiffs_obj_id *) fs->lu_work;
    int cur_entry = starting_lu_entry;
    int entries_per_page = (SPIFFS_CFG_LOG_PAGE_SZ(fs) / sizeof(spiffs_obj_id));

    // wrap initial
    if (cur_entry >= (int) SPIFFS_OBJ_LOOKUP_MAX_ENTRIES(fs) - 1) {
        cur_entry = 0;
        cur_block++;
        cur_block_addr = cur_block * SPIFFS_CFG_LOG_BLOCK_SZ(fs);
        if (cur_block >= fs->block_count) {
            if (flags & SPIFFS_VIS_NO_WRAP) {
                return SPIFFS_VIS_END;
            } else {
                // block wrap
                cur_block = 0;
                cur_block_addr = 0;
            }
        }
    }

    // check each block
    while (res == SPIFFS_OK && entry_count > 0) {
        int obj_lookup_page = cur_entry / entries_per_page;
        // check each object lookup page
        while (res == SPIFFS_OK && obj_lookup_page < (int) SPIFFS_OBJ_LOOKUP_PAGES(fs)) {
            int entry_offset = obj_lookup_page * entries_per_page;
            res = _spiffs_rd(fs, SPIFFS_OP_T_OBJ_LU | SPIFFS_OP_C_READ,
                             0, cur_block_addr + SPIFFS_PAGE_TO_PADDR(fs, obj_lookup_page), SPIFFS_CFG_LOG_PAGE_SZ(fs),
                             fs->lu_work);
            // check each entry
            while (res == SPIFFS_OK &&
                   cur_entry - entry_offset < entries_per_page && // for non-last obj lookup pages
                   cur_entry < (int) SPIFFS_OBJ_LOOKUP_MAX_ENTRIES(fs)) // for last obj lookup page
            {
                if ((flags & SPIFFS_VIS_CHECK_ID) == 0 || obj_lu_buf[cur_entry - entry_offset] == obj_id) {
                    if (block_ix) *block_ix = cur_block;
                    if (lu_entry) *lu_entry = cur_entry;
                    if (v) {
                        res = v(
                                fs,
                                (flags & SPIFFS_VIS_CHECK_PH) ? obj_id : obj_lu_buf[cur_entry - entry_offset],
                                cur_block,
                                cur_entry,
                                user_data,
                                user_p);
                        if (res == SPIFFS_VIS_COUNTINUE || res == SPIFFS_VIS_COUNTINUE_RELOAD) {
                            if (res == SPIFFS_VIS_COUNTINUE_RELOAD) {
                                res = _spiffs_rd(fs, SPIFFS_OP_T_OBJ_LU | SPIFFS_OP_C_READ,
                                                 0, cur_block_addr + SPIFFS_PAGE_TO_PADDR(fs, obj_lookup_page),
                                                 SPIFFS_CFG_LOG_PAGE_SZ(fs), fs->lu_work);
                                SPIFFS_CHECK_RES(res);
                            }
                            res = SPIFFS_OK;
                            cur_entry++;
                            entry_count--;
                            continue;
                        } else {
                            return res;
                        }
                    } else {
                        return SPIFFS_OK;
                    }
                }
                entry_count--;
                cur_entry++;
            } // per entry
            obj_lookup_page++;
        } // per object lookup page
        cur_entry = 0;
        cur_block++;
        cur_block_addr += SPIFFS_CFG_LOG_BLOCK_SZ(fs);
        if (cur_block >= fs->block_count) {
            if (flags & SPIFFS_VIS_NO_WRAP) {
                return SPIFFS_VIS_END;
            } else {
                // block wrap
                cur_block = 0;
                cur_block_addr = 0;
            }
        }
    } // per block

    SPIFFS_CHECK_RES(res);

    return SPIFFS_VIS_END;
}

int32_t spiffs_erase_block(
        spiffs *fs,
        spiffs_block_ix bix) {
    int32_t res;
    u32_t addr = SPIFFS_BLOCK_TO_PADDR(fs, bix);
    int32_t size = SPIFFS_CFG_LOG_BLOCK_SZ(fs);

    // here we ignore res, just try erasing the block
    while (size > 0) {
        SPIFFS_DBG("erase %08x:%08x\n", addr, SPIFFS_CFG_PHYS_ERASE_SZ(fs));
        (void) fs->cfg.hal_erase_f(addr, SPIFFS_CFG_PHYS_ERASE_SZ(fs));
        addr += SPIFFS_CFG_PHYS_ERASE_SZ(fs);
        size -= SPIFFS_CFG_PHYS_ERASE_SZ(fs);
    }
    fs->free_blocks++;

    // register erase count for this block
    res = _spiffs_wr(fs, SPIFFS_OP_C_WRTHRU | SPIFFS_OP_T_OBJ_LU2, 0,
                     SPIFFS_ERASE_COUNT_PADDR(fs, bix),
                     sizeof(spiffs_obj_id), (uint8_t *) &fs->max_erase_count);
    SPIFFS_CHECK_RES(res);

#if SPIFFS_USE_MAGIC
    // finally, write magic
    spiffs_obj_id magic = SPIFFS_MAGIC(fs);
    res = _spiffs_wr(fs, SPIFFS_OP_C_WRTHRU | SPIFFS_OP_T_OBJ_LU2, 0,
        SPIFFS_MAGIC_PADDR(fs, bix),
        sizeof(spiffs_obj_id), (uint8_t *)&magic);
    SPIFFS_CHECK_RES(res);
#endif

    fs->max_erase_count++;
    if (fs->max_erase_count == SPIFFS_OBJ_ID_IX_FLAG) {
        fs->max_erase_count = 0;
    }

    return res;
}


