niclash/forthright/arch/esp8266/spiffs/spiffs_nucleus.c
static int32_t spiffs_obj_lu_scan_v(
        spiffs *fs,
        spiffs_obj_id obj_id,
        spiffs_block_ix bix,
        int ix_entry,
        u32_t user_data,
        void *user_p) {
    (void) bix;
    (void) user_data;
    (void) user_p;
    if (obj_id == SPIFFS_OBJ_ID_FREE) {
        if (ix_entry == 0) {
            fs->free_blocks++;
            // todo optimize further, return SPIFFS_NEXT_BLOCK
        }
    } else if (obj_id == SPIFFS_OBJ_ID_DELETED) {
        fs->stats_p_deleted++;
    } else {
        fs->stats_p_allocated++;
    }

    return SPIFFS_VIS_COUNTINUE;
}


// Scans thru all obj lu and counts free, deleted and used pages
// Find the maximum block erase count
// Checks magic if enabled
int32_t spiffs_obj_lu_scan(
        spiffs *fs) {
    int32_t res;
    spiffs_block_ix bix;
    int entry;
#if SPIFFS_USE_MAGIC
    spiffs_block_ix unerased_bix = (spiffs_block_ix)-1;
#endif

    // find out erase count
    // if enabled, check magic
    bix = 0;
    spiffs_obj_id erase_count_final;
    spiffs_obj_id erase_count_min = SPIFFS_OBJ_ID_FREE;
    spiffs_obj_id erase_count_max = 0;
    while (bix < fs->block_count) {
#if SPIFFS_USE_MAGIC
        spiffs_obj_id magic;
        res = _spiffs_rd(fs,
            SPIFFS_OP_T_OBJ_LU2 | SPIFFS_OP_C_READ,
            0, SPIFFS_MAGIC_PADDR(fs, bix) ,
            sizeof(spiffs_obj_id), (uint8_t *)&magic);

        SPIFFS_CHECK_RES(res);
        if (magic != SPIFFS_MAGIC(fs)) {
          if (unerased_bix == (spiffs_block_ix)-1) {
            // allow one unerased block as it might be powered down during an erase
            unerased_bix = bix;
          } else {
            // more than one unerased block, bail out
            SPIFFS_CHECK_RES(SPIFFS_ERR_NOT_A_FS);
          }
        }
#endif
        spiffs_obj_id erase_count;
        res = _spiffs_rd(fs,
                         SPIFFS_OP_T_OBJ_LU2 | SPIFFS_OP_C_READ,
                         0, SPIFFS_ERASE_COUNT_PADDR(fs, bix),
                         sizeof(spiffs_obj_id), (uint8_t *) &erase_count);
        SPIFFS_CHECK_RES(res);
        if (erase_count != SPIFFS_OBJ_ID_FREE) {
            erase_count_min = MIN(erase_count_min, erase_count);
            erase_count_max = MAX(erase_count_max, erase_count);
        }
        bix++;
    }

    if (erase_count_min == 0 && erase_count_max == SPIFFS_OBJ_ID_FREE) {
        // clean system, set counter to zero
        erase_count_final = 0;
    } else if (erase_count_max - erase_count_min > (SPIFFS_OBJ_ID_FREE) / 2) {
        // wrap, take min
        erase_count_final = erase_count_min + 1;
    } else {
        erase_count_final = erase_count_max + 1;
    }

    fs->max_erase_count = erase_count_final;

#if SPIFFS_USE_MAGIC
    if (unerased_bix != (spiffs_block_ix)-1) {
      // found one unerased block, remedy
      SPIFFS_DBG("mount: erase block %i\n", bix);
      res = spiffs_erase_block(fs, unerased_bix);
      SPIFFS_CHECK_RES(res);
    }
#endif

    // count blocks

    fs->free_blocks = 0;
    fs->stats_p_allocated = 0;
    fs->stats_p_deleted = 0;

    res = spiffs_obj_lu_find_entry_visitor(fs,
                                           0,
                                           0,
                                           0,
                                           0,
                                           spiffs_obj_lu_scan_v,
                                           0,
                                           0,
                                           &bix,
                                           &entry);

    if (res == SPIFFS_VIS_END) {
        res = SPIFFS_OK;
    }

    SPIFFS_CHECK_RES(res);

    return res;
}

// Find free object lookup entry
// Iterate over object lookup pages in each block until a free object id entry is found
int32_t spiffs_obj_lu_find_free(
        spiffs *fs,
        spiffs_block_ix starting_block,
        int starting_lu_entry,
        spiffs_block_ix *block_ix,
        int *lu_entry) {
    int32_t res;
    if (!fs->cleaning && fs->free_blocks < 2) {
        res = spiffs_gc_quick(fs, 0);
        if (res == SPIFFS_ERR_NO_DELETED_BLOCKS) {
            res = SPIFFS_OK;
        }
        SPIFFS_CHECK_RES(res);
        if (fs->free_blocks < 2) {
            return SPIFFS_ERR_FULL;
        }
    }
    res = spiffs_obj_lu_find_id(fs, starting_block, starting_lu_entry,
                                SPIFFS_OBJ_ID_FREE, block_ix, lu_entry);
    if (res == SPIFFS_OK) {
        fs->free_cursor_block_ix = *block_ix;
        fs->free_cursor_obj_lu_entry = *lu_entry;
        if (*lu_entry == 0) {
            fs->free_blocks--;
        }
    }
    if (res == SPIFFS_VIS_END) {
        SPIFFS_DBG("fs full\n");
    }

    return res == SPIFFS_VIS_END ? SPIFFS_ERR_FULL : res;
}

// Find object lookup entry containing given id
// Iterate over object lookup pages in each block until a given object id entry is found
int32_t spiffs_obj_lu_find_id(
        spiffs *fs,
        spiffs_block_ix starting_block,
        int starting_lu_entry,
        spiffs_obj_id obj_id,
        spiffs_block_ix *block_ix,
        int *lu_entry) {
    int32_t res = spiffs_obj_lu_find_entry_visitor(
            fs, starting_block, starting_lu_entry, SPIFFS_VIS_CHECK_ID, obj_id, 0, 0, 0, block_ix, lu_entry);
    if (res == SPIFFS_VIS_END) {
        res = SPIFFS_ERR_NOT_FOUND;
    }
    return res;
}


static int32_t spiffs_obj_lu_find_id_and_span_v(
        spiffs *fs,
        spiffs_obj_id obj_id,
        spiffs_block_ix bix,
        int ix_entry,
        u32_t user_data,
        void *user_p) {
    int32_t res;
    spiffs_page_header ph;
    spiffs_page_ix pix = SPIFFS_OBJ_LOOKUP_ENTRY_TO_PIX(fs, bix, ix_entry);
    res = _spiffs_rd(fs, 0, SPIFFS_OP_T_OBJ_LU2 | SPIFFS_OP_C_READ,
                     SPIFFS_PAGE_TO_PADDR(fs, pix), sizeof(spiffs_page_header), (uint8_t *) &ph);
    SPIFFS_CHECK_RES(res);
    if (ph.obj_id == obj_id &&
        ph.span_ix == (spiffs_span_ix) user_data &&
        (ph.flags & (SPIFFS_PH_FLAG_FINAL | SPIFFS_PH_FLAG_DELET | SPIFFS_PH_FLAG_USED)) == SPIFFS_PH_FLAG_DELET &&
        !((obj_id & SPIFFS_OBJ_ID_IX_FLAG) && (ph.flags & SPIFFS_PH_FLAG_IXDELE) == 0 && ph.span_ix == 0) &&
        (user_p == 0 || *((spiffs_page_ix *) user_p) != pix)) {
        return SPIFFS_OK;
    } else {
        return SPIFFS_VIS_COUNTINUE;
    }
}

// Find object lookup entry containing given id and span index
// Iterate over object lookup pages in each block until a given object id entry is found
int32_t spiffs_obj_lu_find_id_and_span(
        spiffs *fs,
        spiffs_obj_id obj_id,
        spiffs_span_ix spix,
        spiffs_page_ix exclusion_pix,
        spiffs_page_ix *pix) {
    int32_t res;
    spiffs_block_ix bix;
    int entry;

