niclash/forthright/arch/esp8266/spiffs/spiffs_nucleus.c
    res = spiffs_obj_lu_find_entry_visitor(fs,
                                           fs->cursor_block_ix,
                                           fs->cursor_obj_lu_entry,
                                           SPIFFS_VIS_CHECK_ID,
                                           obj_id,
                                           spiffs_obj_lu_find_id_and_span_v,
                                           (u32_t) spix,
                                           exclusion_pix ? &exclusion_pix : 0,
                                           &bix,
                                           &entry);

    if (res == SPIFFS_VIS_END) {
        res = SPIFFS_ERR_NOT_FOUND;
    }

    SPIFFS_CHECK_RES(res);

    if (pix) {
        *pix = SPIFFS_OBJ_LOOKUP_ENTRY_TO_PIX(fs, bix, entry);
    }

    fs->cursor_block_ix = bix;
    fs->cursor_obj_lu_entry = entry;

    return res;
}

// Find object lookup entry containing given id and span index in page headers only
// Iterate over object lookup pages in each block until a given object id entry is found
int32_t spiffs_obj_lu_find_id_and_span_by_phdr(
        spiffs *fs,
        spiffs_obj_id obj_id,
        spiffs_span_ix spix,
        spiffs_page_ix exclusion_pix,
        spiffs_page_ix *pix) {
    int32_t res;
    spiffs_block_ix bix;
    int entry;

    res = spiffs_obj_lu_find_entry_visitor(fs,
                                           fs->cursor_block_ix,
                                           fs->cursor_obj_lu_entry,
                                           SPIFFS_VIS_CHECK_PH,
                                           obj_id,
                                           spiffs_obj_lu_find_id_and_span_v,
                                           (u32_t) spix,
                                           exclusion_pix ? &exclusion_pix : 0,
                                           &bix,
                                           &entry);

    if (res == SPIFFS_VIS_END) {
        res = SPIFFS_ERR_NOT_FOUND;
    }

    SPIFFS_CHECK_RES(res);

    if (pix) {
        *pix = SPIFFS_OBJ_LOOKUP_ENTRY_TO_PIX(fs, bix, entry);
    }

    fs->cursor_block_ix = bix;
    fs->cursor_obj_lu_entry = entry;

    return res;
}

// Allocates a free defined page with given obj_id
// Occupies object lookup entry and page
// data may be NULL; where only page header is stored, len and page_offs is ignored
int32_t spiffs_page_allocate_data(
        spiffs *fs,
        spiffs_obj_id obj_id,
        spiffs_page_header *ph,
        uint8_t *data,
        u32_t len,
        u32_t page_offs,
        uint8_t finalize,
        spiffs_page_ix *pix) {
    int32_t res = SPIFFS_OK;
    spiffs_block_ix bix;
    int entry;

    // find free entry
    res = spiffs_obj_lu_find_free(fs, fs->free_cursor_block_ix, fs->free_cursor_obj_lu_entry, &bix, &entry);
    SPIFFS_CHECK_RES(res);

    // occupy page in object lookup
    res = _spiffs_wr(fs, SPIFFS_OP_T_OBJ_LU | SPIFFS_OP_C_UPDT,
                     0, SPIFFS_BLOCK_TO_PADDR(fs, bix) + entry * sizeof(spiffs_obj_id), sizeof(spiffs_obj_id),
                     (uint8_t *) &obj_id);
    SPIFFS_CHECK_RES(res);

    fs->stats_p_allocated++;

    // write page header
    ph->flags &= ~SPIFFS_PH_FLAG_USED;
    res = _spiffs_wr(fs, SPIFFS_OP_T_OBJ_DA | SPIFFS_OP_C_UPDT,
                     0, SPIFFS_OBJ_LOOKUP_ENTRY_TO_PADDR(fs, bix, entry), sizeof(spiffs_page_header), (uint8_t *) ph);
    SPIFFS_CHECK_RES(res);

    // write page data
    if (data) {
        res = _spiffs_wr(fs, SPIFFS_OP_T_OBJ_DA | SPIFFS_OP_C_UPDT,
                         0, SPIFFS_OBJ_LOOKUP_ENTRY_TO_PADDR(fs, bix, entry) + sizeof(spiffs_page_header) + page_offs,
                         len, data);
        SPIFFS_CHECK_RES(res);
    }

    // finalize header if necessary
    if (finalize && (ph->flags & SPIFFS_PH_FLAG_FINAL)) {
        ph->flags &= ~SPIFFS_PH_FLAG_FINAL;
        res = _spiffs_wr(fs, SPIFFS_OP_T_OBJ_DA | SPIFFS_OP_C_UPDT,
                         0, SPIFFS_OBJ_LOOKUP_ENTRY_TO_PADDR(fs, bix, entry) + offsetof(spiffs_page_header, flags),
                         sizeof(uint8_t),
                         (uint8_t *) &ph->flags);
        SPIFFS_CHECK_RES(res);
    }

    // return written page
    if (pix) {
        *pix = SPIFFS_OBJ_LOOKUP_ENTRY_TO_PIX(fs, bix, entry);
    }

    return res;
}

// Moves a page from src to a free page and finalizes it. Updates page index. Page data is given in param page.
// If page data is null, provided header is used for metainfo and page data is physically copied.
int32_t spiffs_page_move(
        spiffs *fs,
        spiffs_file fh,
        uint8_t *page_data,
        spiffs_obj_id obj_id,
        spiffs_page_header *page_hdr,
        spiffs_page_ix src_pix,
        spiffs_page_ix *dst_pix) {
    int32_t res;
    uint8_t was_final = 0;
    spiffs_page_header *p_hdr;
    spiffs_block_ix bix;
    int entry;
    spiffs_page_ix free_pix;

    // find free entry
    res = spiffs_obj_lu_find_free(fs, fs->free_cursor_block_ix, fs->free_cursor_obj_lu_entry, &bix, &entry);
    SPIFFS_CHECK_RES(res);
    free_pix = SPIFFS_OBJ_LOOKUP_ENTRY_TO_PIX(fs, bix, entry);

    if (dst_pix) *dst_pix = free_pix;

    p_hdr = page_data ? (spiffs_page_header *) page_data : page_hdr;
    if (page_data) {
        // got page data
        was_final = (p_hdr->flags & SPIFFS_PH_FLAG_FINAL) == 0;
        // write unfinalized page
        p_hdr->flags |= SPIFFS_PH_FLAG_FINAL;
        p_hdr->flags &= ~SPIFFS_PH_FLAG_USED;
        res = _spiffs_wr(fs, SPIFFS_OP_T_OBJ_DA | SPIFFS_OP_C_UPDT,
                         0, SPIFFS_PAGE_TO_PADDR(fs, free_pix), SPIFFS_CFG_LOG_PAGE_SZ(fs), page_data);
    } else {
        // copy page data
        res = spiffs_phys_cpy(fs, fh, SPIFFS_PAGE_TO_PADDR(fs, free_pix), SPIFFS_PAGE_TO_PADDR(fs, src_pix),
                              SPIFFS_CFG_LOG_PAGE_SZ(fs));
    }
    SPIFFS_CHECK_RES(res);

    // mark entry in destination object lookup
    res = _spiffs_wr(fs, SPIFFS_OP_T_OBJ_LU | SPIFFS_OP_C_UPDT,
                     0, SPIFFS_BLOCK_TO_PADDR(fs, SPIFFS_BLOCK_FOR_PAGE(fs, free_pix)) +
                        SPIFFS_OBJ_LOOKUP_ENTRY_FOR_PAGE(fs, free_pix) * sizeof(spiffs_page_ix),
                     sizeof(spiffs_obj_id),
                     (uint8_t *) &obj_id);
    SPIFFS_CHECK_RES(res);

    fs->stats_p_allocated++;

    if (was_final) {
        // mark finalized in destination page
        p_hdr->flags &= ~(SPIFFS_PH_FLAG_FINAL | SPIFFS_PH_FLAG_USED);
        res = _spiffs_wr(fs, SPIFFS_OP_T_OBJ_DA | SPIFFS_OP_C_UPDT,
                         fh,
                         SPIFFS_PAGE_TO_PADDR(fs, free_pix) + offsetof(spiffs_page_header, flags),
                         sizeof(uint8_t),
                         (uint8_t *) &p_hdr->flags);
        SPIFFS_CHECK_RES(res);
    }
    // mark source deleted
    res = spiffs_page_delete(fs, src_pix);
    return res;
}

// Deletes a page and removes it from object lookup.
int32_t spiffs_page_delete(
        spiffs *fs,
        spiffs_page_ix pix) {
    int32_t res;
    spiffs_page_header hdr;
    hdr.flags = 0xff & ~(SPIFFS_PH_FLAG_DELET | SPIFFS_PH_FLAG_USED);
    // mark deleted entry in source object lookup
    spiffs_obj_id d_obj_id = SPIFFS_OBJ_ID_DELETED;
    res = _spiffs_wr(fs, SPIFFS_OP_T_OBJ_LU | SPIFFS_OP_C_DELE,
                     0,
                     SPIFFS_BLOCK_TO_PADDR(fs, SPIFFS_BLOCK_FOR_PAGE(fs, pix)) +
                     SPIFFS_OBJ_LOOKUP_ENTRY_FOR_PAGE(fs, pix) * sizeof(spiffs_page_ix),
                     sizeof(spiffs_obj_id),
                     (uint8_t *) &d_obj_id);
    SPIFFS_CHECK_RES(res);

    fs->stats_p_deleted++;
    fs->stats_p_allocated--;

    // mark deleted in source page
    res = _spiffs_wr(fs, SPIFFS_OP_T_OBJ_DA | SPIFFS_OP_C_DELE,
                     0,
                     SPIFFS_PAGE_TO_PADDR(fs, pix) + offsetof(spiffs_page_header, flags),
                     sizeof(uint8_t),
                     (uint8_t *) &hdr.flags);

    return res;
}

