niclash/forthright/arch/esp8266/spiffs/spiffs_nucleus.c
// Create an object index header page with empty index and undefined length
int32_t spiffs_object_create(
        spiffs *fs,
        spiffs_obj_id obj_id,
        uint8_t name[SPIFFS_OBJ_NAME_LEN],
        spiffs_obj_type type,
        spiffs_page_ix *objix_hdr_pix) {
    int32_t res = SPIFFS_OK;
    spiffs_block_ix bix;
    spiffs_page_object_ix_header oix_hdr;
    int entry;

    res = spiffs_gc_check(fs, SPIFFS_DATA_PAGE_SIZE(fs));
    SPIFFS_CHECK_RES(res);

    obj_id |= SPIFFS_OBJ_ID_IX_FLAG;

    // find free entry
    res = spiffs_obj_lu_find_free(fs, fs->free_cursor_block_ix, fs->free_cursor_obj_lu_entry, &bix, &entry);
    SPIFFS_CHECK_RES(res);
    SPIFFS_DBG("create: found free page @ %04x bix:%i entry:%i\n", SPIFFS_OBJ_LOOKUP_ENTRY_TO_PIX(fs, bix, entry), bix,
               entry);

    // occupy page in object lookup
    res = _spiffs_wr(fs, SPIFFS_OP_T_OBJ_LU | SPIFFS_OP_C_UPDT,
                     0, SPIFFS_BLOCK_TO_PADDR(fs, bix) + entry * sizeof(spiffs_obj_id), sizeof(spiffs_obj_id),
                     (uint8_t *) &obj_id);
    SPIFFS_CHECK_RES(res);

    fs->stats_p_allocated++;

    // write empty object index page
    oix_hdr.p_hdr.obj_id = obj_id;
    oix_hdr.p_hdr.span_ix = 0;
    oix_hdr.p_hdr.flags = 0xff & ~(SPIFFS_PH_FLAG_FINAL | SPIFFS_PH_FLAG_INDEX | SPIFFS_PH_FLAG_USED);
    oix_hdr.type = type;
    oix_hdr.size = SPIFFS_UNDEFINED_LEN; // keep ones so we can update later without wasting this page
    strncpy((char *) &oix_hdr.name, (char *) name, SPIFFS_OBJ_NAME_LEN);


    // update page
    res = _spiffs_wr(fs, SPIFFS_OP_T_OBJ_DA | SPIFFS_OP_C_UPDT,
                     0, SPIFFS_OBJ_LOOKUP_ENTRY_TO_PADDR(fs, bix, entry), sizeof(spiffs_page_object_ix_header),
                     (uint8_t *) &oix_hdr);

    SPIFFS_CHECK_RES(res);
    spiffs_cb_object_event(fs, 0, SPIFFS_EV_IX_NEW, obj_id, 0, SPIFFS_OBJ_LOOKUP_ENTRY_TO_PIX(fs, bix, entry),
                           SPIFFS_UNDEFINED_LEN);

    if (objix_hdr_pix) {
        *objix_hdr_pix = SPIFFS_OBJ_LOOKUP_ENTRY_TO_PIX(fs, bix, entry);
    }

    return res;
}

// update object index header with any combination of name/size/index
// new_objix_hdr_data may be null, if so the object index header page is loaded
// name may be null, if so name is not changed
// size may be null, if so size is not changed
int32_t spiffs_object_update_index_hdr(
        spiffs *fs,
        spiffs_fd *fd,
        spiffs_obj_id obj_id,
        spiffs_page_ix objix_hdr_pix,
        uint8_t *new_objix_hdr_data,
        uint8_t name[SPIFFS_OBJ_NAME_LEN],
        u32_t size,
        spiffs_page_ix *new_pix) {
    int32_t res = SPIFFS_OK;
    spiffs_page_object_ix_header *objix_hdr;
    spiffs_page_ix new_objix_hdr_pix;

    obj_id |= SPIFFS_OBJ_ID_IX_FLAG;

    if (new_objix_hdr_data) {
        // object index header page already given to us, no need to load it
        objix_hdr = (spiffs_page_object_ix_header *) new_objix_hdr_data;
    } else {
        // read object index header page
        res = _spiffs_rd(fs, SPIFFS_OP_T_OBJ_IX | SPIFFS_OP_C_READ,
                         fd->file_nbr, SPIFFS_PAGE_TO_PADDR(fs, objix_hdr_pix), SPIFFS_CFG_LOG_PAGE_SZ(fs), fs->work);
        SPIFFS_CHECK_RES(res);
        objix_hdr = (spiffs_page_object_ix_header *) fs->work;
    }

    SPIFFS_VALIDATE_OBJIX(objix_hdr->p_hdr, obj_id, 0);

    // change name
    if (name) {
        strncpy((char *) objix_hdr->name, (char *) name, SPIFFS_OBJ_NAME_LEN);
    }
    if (size) {
        objix_hdr->size = size;
    }

    // move and update page
    res = spiffs_page_move(fs, fd == 0 ? 0 : fd->file_nbr, (uint8_t *) objix_hdr, obj_id, 0, objix_hdr_pix,
                           &new_objix_hdr_pix);

    if (res == SPIFFS_OK) {
        if (new_pix) {
            *new_pix = new_objix_hdr_pix;
        }
        // callback on object index update
        spiffs_cb_object_event(fs, fd, SPIFFS_EV_IX_UPD, obj_id, objix_hdr->p_hdr.span_ix, new_objix_hdr_pix,
                               objix_hdr->size);
        if (fd) fd->objix_hdr_pix = new_objix_hdr_pix; // if this is not in the registered cluster
    }

    return res;
}

void spiffs_cb_object_event(
        spiffs *fs,
        spiffs_fd *fd,
        int ev,
        spiffs_obj_id obj_id,
        spiffs_span_ix spix,
        spiffs_page_ix new_pix,
        u32_t new_size) {
    (void) fd;
    // update index caches in all file descriptors
    obj_id &= ~SPIFFS_OBJ_ID_IX_FLAG;
    u32_t i;
    spiffs_fd *fds = (spiffs_fd *) fs->fd_space;
    for (i = 0; i < fs->fd_count; i++) {
        spiffs_fd *cur_fd = &fds[i];
        if (cur_fd->file_nbr == 0 || (cur_fd->obj_id & ~SPIFFS_OBJ_ID_IX_FLAG) != obj_id) continue;
        if (spix == 0) {
            if (ev == SPIFFS_EV_IX_NEW || ev == SPIFFS_EV_IX_UPD) {
                SPIFFS_DBG("       callback: setting fd %i:%04x objix_hdr_pix to %04x, size:%i\n", cur_fd->file_nbr,
                           cur_fd->obj_id, new_pix, new_size);
                cur_fd->objix_hdr_pix = new_pix;
                if (new_size != 0) {
                    cur_fd->size = new_size;
                }
            } else if (ev == SPIFFS_EV_IX_DEL) {
                cur_fd->file_nbr = 0;
                cur_fd->obj_id = SPIFFS_OBJ_ID_DELETED;
            }
        }
        if (cur_fd->cursor_objix_spix == spix) {
            if (ev == SPIFFS_EV_IX_NEW || ev == SPIFFS_EV_IX_UPD) {
                SPIFFS_DBG("       callback: setting fd %i:%04x span:%04x objix_pix to %04x\n", cur_fd->file_nbr,
                           cur_fd->obj_id, spix, new_pix);
                cur_fd->cursor_objix_pix = new_pix;
            } else {
                cur_fd->cursor_objix_pix = 0;
            }
        }
    }
}

// Open object by id
int32_t spiffs_object_open_by_id(
        spiffs *fs,
        spiffs_obj_id obj_id,
        spiffs_fd *fd,
        spiffs_flags flags,
        spiffs_mode mode) {
    int32_t res = SPIFFS_OK;
    spiffs_page_ix pix;

    res = spiffs_obj_lu_find_id_and_span(fs, obj_id | SPIFFS_OBJ_ID_IX_FLAG, 0, 0, &pix);
    SPIFFS_CHECK_RES(res);

    res = spiffs_object_open_by_page(fs, pix, fd, flags, mode);

    return res;
}

// Open object by page index
int32_t spiffs_object_open_by_page(
        spiffs *fs,
        spiffs_page_ix pix,
        spiffs_fd *fd,
        spiffs_flags flags,
        spiffs_mode mode) {
    (void) mode;
    int32_t res = SPIFFS_OK;
    spiffs_page_object_ix_header oix_hdr;
    spiffs_obj_id obj_id;

