niclash/forthright/arch/esp8266/spiffs/spiffs_nucleus.c
    res = _spiffs_rd(fs, SPIFFS_OP_T_OBJ_IX | SPIFFS_OP_C_READ,
                     fd->file_nbr, SPIFFS_PAGE_TO_PADDR(fs, pix), sizeof(spiffs_page_object_ix_header),
                     (uint8_t *) &oix_hdr);
    SPIFFS_CHECK_RES(res);

    spiffs_block_ix bix = SPIFFS_BLOCK_FOR_PAGE(fs, pix);
    int entry = SPIFFS_OBJ_LOOKUP_ENTRY_FOR_PAGE(fs, pix);

    res = _spiffs_rd(fs, SPIFFS_OP_T_OBJ_LU | SPIFFS_OP_C_READ,
                     0, SPIFFS_BLOCK_TO_PADDR(fs, bix) + entry * sizeof(spiffs_obj_id), sizeof(spiffs_obj_id),
                     (uint8_t *) &obj_id);

    fd->fs = fs;
    fd->objix_hdr_pix = pix;
    fd->size = oix_hdr.size;
    fd->offset = 0;
    fd->cursor_objix_pix = pix;
    fd->cursor_objix_spix = 0;
    fd->obj_id = obj_id;
    fd->flags = flags;

    SPIFFS_VALIDATE_OBJIX(oix_hdr.p_hdr, fd->obj_id, 0);

    SPIFFS_DBG("open: fd %i is obj id %04x\n", fd->file_nbr, fd->obj_id);

    return res;
}

// Append to object
// keep current object index (header) page in fs->work buffer
int32_t spiffs_object_append(spiffs_fd *fd, u32_t offset, uint8_t *data, u32_t len) {
    spiffs *fs = fd->fs;
    int32_t res = SPIFFS_OK;
    u32_t written = 0;

    SPIFFS_DBG("append: %i bytes @ offs %i of size %i\n", len, offset, fd->size);

    if (offset > fd->size) {
        SPIFFS_DBG("append: offset reversed to size\n");
        offset = fd->size;
    }

    res = spiffs_gc_check(fs, len + SPIFFS_DATA_PAGE_SIZE(fs)); // add an extra page of data worth for meta
    if (res != SPIFFS_OK) {
        SPIFFS_DBG("append: gc check fail %i\n", res);
    }
    SPIFFS_CHECK_RES(res);

    spiffs_page_object_ix_header *objix_hdr = (spiffs_page_object_ix_header *) fs->work;
    spiffs_page_object_ix *objix = (spiffs_page_object_ix *) fs->work;
    spiffs_page_header p_hdr;

    spiffs_span_ix cur_objix_spix = 0;
    spiffs_span_ix prev_objix_spix = (spiffs_span_ix) -1;
    spiffs_page_ix cur_objix_pix = fd->objix_hdr_pix;
    spiffs_page_ix new_objix_hdr_page;

    spiffs_span_ix data_spix = offset / SPIFFS_DATA_PAGE_SIZE(fs);
    spiffs_page_ix data_page;
    u32_t page_offs = offset % SPIFFS_DATA_PAGE_SIZE(fs);

    // write all data
    while (res == SPIFFS_OK && written < len) {
        // calculate object index page span index
        cur_objix_spix = SPIFFS_OBJ_IX_ENTRY_SPAN_IX(fs, data_spix);

        // handle storing and loading of object indices
        if (cur_objix_spix != prev_objix_spix) {
            // new object index page
            // within this clause we return directly if something fails, object index mess-up
            if (written > 0) {
                // store previous object index page, unless first pass
                SPIFFS_DBG("append: %04x store objix %04x:%04x, written %i\n", fd->obj_id,
                           cur_objix_pix, prev_objix_spix, written);
                if (prev_objix_spix == 0) {
                    // this is an update to object index header page
                    objix_hdr->size = offset + written;
                    if (offset == 0) {
                        // was an empty object, update same page (size was 0xffffffff)
                        res = spiffs_page_index_check(fs, fd, cur_objix_pix, 0);
                        SPIFFS_CHECK_RES(res);
                        res = _spiffs_wr(fs, SPIFFS_OP_T_OBJ_IX | SPIFFS_OP_C_UPDT,
                                         fd->file_nbr, SPIFFS_PAGE_TO_PADDR(fs, cur_objix_pix),
                                         SPIFFS_CFG_LOG_PAGE_SZ(fs), fs->work);
                        SPIFFS_CHECK_RES(res);
                    } else {
                        // was a nonempty object, update to new page
                        res = spiffs_object_update_index_hdr(fs, fd, fd->obj_id,
                                                             fd->objix_hdr_pix, fs->work, 0, offset + written,
                                                             &new_objix_hdr_page);
                        SPIFFS_CHECK_RES(res);
                        SPIFFS_DBG("append: %04x store new objix_hdr, %04x:%04x, written %i\n", fd->obj_id,
                                   new_objix_hdr_page, 0, written);
                    }
                } else {
                    // this is an update to an object index page
                    res = spiffs_page_index_check(fs, fd, cur_objix_pix, prev_objix_spix);
                    SPIFFS_CHECK_RES(res);

                    res = _spiffs_wr(fs, SPIFFS_OP_T_OBJ_IX | SPIFFS_OP_C_UPDT,
                                     fd->file_nbr, SPIFFS_PAGE_TO_PADDR(fs, cur_objix_pix), SPIFFS_CFG_LOG_PAGE_SZ(fs),
                                     fs->work);
                    SPIFFS_CHECK_RES(res);
                    spiffs_cb_object_event(fs, fd, SPIFFS_EV_IX_UPD, fd->obj_id, objix->p_hdr.span_ix, cur_objix_pix,
                                           0);
                    // update length in object index header page
                    res = spiffs_object_update_index_hdr(fs, fd, fd->obj_id,
                                                         fd->objix_hdr_pix, 0, 0, offset + written,
                                                         &new_objix_hdr_page);
                    SPIFFS_CHECK_RES(res);
                    SPIFFS_DBG("append: %04x store new size I %i in objix_hdr, %04x:%04x, written %i\n", fd->obj_id,
                               offset + written, new_objix_hdr_page, 0, written);
                }
                fd->size = offset + written;
                fd->offset = offset + written;
            }

            // create or load new object index page
            if (cur_objix_spix == 0) {
                // load object index header page, must always exist
                SPIFFS_DBG("append: %04x load objixhdr page %04x:%04x\n", fd->obj_id, cur_objix_pix, cur_objix_spix);
                res = _spiffs_rd(fs, SPIFFS_OP_T_OBJ_IX | SPIFFS_OP_C_READ,
                                 fd->file_nbr, SPIFFS_PAGE_TO_PADDR(fs, cur_objix_pix), SPIFFS_CFG_LOG_PAGE_SZ(fs),
                                 fs->work);
                SPIFFS_CHECK_RES(res);
                SPIFFS_VALIDATE_OBJIX(objix_hdr->p_hdr, fd->obj_id, cur_objix_spix);
            } else {
                spiffs_span_ix len_objix_spix = SPIFFS_OBJ_IX_ENTRY_SPAN_IX(fs,
                                                                            (fd->size - 1) / SPIFFS_DATA_PAGE_SIZE(fs));
                // on subsequent passes, create a new object index page
                if (written > 0 || cur_objix_spix > len_objix_spix) {
                    p_hdr.obj_id = fd->obj_id | SPIFFS_OBJ_ID_IX_FLAG;
                    p_hdr.span_ix = cur_objix_spix;
                    p_hdr.flags = 0xff & ~(SPIFFS_PH_FLAG_FINAL | SPIFFS_PH_FLAG_INDEX);
                    res = spiffs_page_allocate_data(fs, fd->obj_id | SPIFFS_OBJ_ID_IX_FLAG,
                                                    &p_hdr, 0, 0, 0, 1, &cur_objix_pix);
                    SPIFFS_CHECK_RES(res);
                    spiffs_cb_object_event(fs, fd, SPIFFS_EV_IX_NEW, fd->obj_id, cur_objix_spix, cur_objix_pix, 0);
                    // quick "load" of new object index page
                    memset(fs->work, 0xff, SPIFFS_CFG_LOG_PAGE_SZ(fs));
                    memcpy(fs->work, &p_hdr, sizeof(spiffs_page_header));
                    SPIFFS_DBG("append: %04x create objix page, %04x:%04x, written %i\n", fd->obj_id, cur_objix_pix,
                               cur_objix_spix, written);
                } else {
                    // on first pass, we load existing object index page
                    spiffs_page_ix pix;
                    SPIFFS_DBG("append: %04x find objix span_ix:%04x\n", fd->obj_id, cur_objix_spix);
                    if (fd->cursor_objix_spix == cur_objix_spix) {
                        pix = fd->cursor_objix_pix;
                    } else {
                        res = spiffs_obj_lu_find_id_and_span(fs, fd->obj_id | SPIFFS_OBJ_ID_IX_FLAG, cur_objix_spix, 0,
                                                             &pix);
                        SPIFFS_CHECK_RES(res);
                    }
                    SPIFFS_DBG("append: %04x found object index at page %04x [fd size %i]\n", fd->obj_id, pix,
                               fd->size);
                    res = _spiffs_rd(fs, SPIFFS_OP_T_OBJ_IX | SPIFFS_OP_C_READ,
                                     fd->file_nbr, SPIFFS_PAGE_TO_PADDR(fs, pix), SPIFFS_CFG_LOG_PAGE_SZ(fs), fs->work);
                    SPIFFS_CHECK_RES(res);
                    SPIFFS_VALIDATE_OBJIX(objix_hdr->p_hdr, fd->obj_id, cur_objix_spix);
                    cur_objix_pix = pix;
                }
                fd->cursor_objix_pix = cur_objix_pix;
                fd->cursor_objix_spix = cur_objix_spix;
                fd->offset = offset + written;
                fd->size = offset + written;
            }
            prev_objix_spix = cur_objix_spix;
        }

