niclash/forthright/arch/esp8266/spiffs/spiffs_nucleus.c
        // write data
        u32_t to_write = MIN(len - written, SPIFFS_DATA_PAGE_SIZE(fs) - page_offs);
        if (page_offs == 0) {
            // at beginning of a page, allocate and write a new page of data
            p_hdr.obj_id = fd->obj_id & ~SPIFFS_OBJ_ID_IX_FLAG;
            p_hdr.span_ix = data_spix;
            p_hdr.flags = 0xff & ~(SPIFFS_PH_FLAG_FINAL);  // finalize immediately
            res = spiffs_page_allocate_data(fs, fd->obj_id & ~SPIFFS_OBJ_ID_IX_FLAG,
                                            &p_hdr, &data[written], to_write, page_offs, 1, &data_page);
            SPIFFS_DBG("append: %04x store new data page, %04x:%04x offset:%i, len %i, written %i\n", fd->obj_id,
                       data_page, data_spix, page_offs, to_write, written);
        } else {
            // append to existing page, fill out free data in existing page
            if (cur_objix_spix == 0) {
                // get data page from object index header page
                data_page = ((spiffs_page_ix *) ((uint8_t *) objix_hdr + sizeof(spiffs_page_object_ix_header)))[data_spix];
            } else {
                // get data page from object index page
                data_page = ((spiffs_page_ix *) ((uint8_t *) objix + sizeof(spiffs_page_object_ix)))[SPIFFS_OBJ_IX_ENTRY(
                        fs, data_spix)];
            }

            res = spiffs_page_data_check(fs, fd, data_page, data_spix);
            SPIFFS_CHECK_RES(res);

            res = _spiffs_wr(fs, SPIFFS_OP_T_OBJ_DA | SPIFFS_OP_C_UPDT,
                             fd->file_nbr, SPIFFS_PAGE_TO_PADDR(fs, data_page) + sizeof(spiffs_page_header) + page_offs,
                             to_write, &data[written]);
            SPIFFS_DBG("append: %04x store to existing data page, %04x:%04x offset:%i, len %i, written %i\n",
                       fd->obj_id, data_page, data_spix, page_offs, to_write, written);
        }

        if (res != SPIFFS_OK) break;

        // update memory representation of object index page with new data page
        if (cur_objix_spix == 0) {
            // update object index header page
            ((spiffs_page_ix *) ((uint8_t *) objix_hdr + sizeof(spiffs_page_object_ix_header)))[data_spix] = data_page;
            SPIFFS_DBG("append: %04x wrote page %04x to objix_hdr entry %02x in mem\n", fd->obj_id, data_page,
                       data_spix);
            objix_hdr->size = offset + written;
        } else {
            // update object index page
            ((spiffs_page_ix *) ((uint8_t *) objix + sizeof(spiffs_page_object_ix)))[SPIFFS_OBJ_IX_ENTRY(fs,
                                                                                                      data_spix)] = data_page;
            SPIFFS_DBG("append: %04x wrote page %04x to objix entry %02x in mem\n", fd->obj_id, data_page,
                       SPIFFS_OBJ_IX_ENTRY(fs, data_spix));
        }

        // update internals
        page_offs = 0;
        data_spix++;
        written += to_write;
    } // while all data

    fd->size = offset + written;
    fd->offset = offset + written;
    fd->cursor_objix_pix = cur_objix_pix;
    fd->cursor_objix_spix = cur_objix_spix;

    // finalize updated object indices
    int32_t res2 = SPIFFS_OK;
    if (cur_objix_spix != 0) {
        // wrote beyond object index header page
        // write last modified object index page, unless object header index page
        SPIFFS_DBG("append: %04x store objix page, %04x:%04x, written %i\n", fd->obj_id,
                   cur_objix_pix, cur_objix_spix, written);

        res2 = spiffs_page_index_check(fs, fd, cur_objix_pix, cur_objix_spix);
        SPIFFS_CHECK_RES(res2);

        res2 = _spiffs_wr(fs, SPIFFS_OP_T_OBJ_IX | SPIFFS_OP_C_UPDT,
                          fd->file_nbr, SPIFFS_PAGE_TO_PADDR(fs, cur_objix_pix), SPIFFS_CFG_LOG_PAGE_SZ(fs), fs->work);
        SPIFFS_CHECK_RES(res2);
        spiffs_cb_object_event(fs, fd, SPIFFS_EV_IX_UPD, fd->obj_id, objix->p_hdr.span_ix, cur_objix_pix, 0);

        // update size in object header index page
        res2 = spiffs_object_update_index_hdr(fs, fd, fd->obj_id,
                                              fd->objix_hdr_pix, 0, 0, offset + written, &new_objix_hdr_page);
        SPIFFS_DBG("append: %04x store new size II %i in objix_hdr, %04x:%04x, written %i, res %i\n", fd->obj_id,
                   offset + written, new_objix_hdr_page, 0, written, res2);
        SPIFFS_CHECK_RES(res2);
    } else {
        // wrote within object index header page
        if (offset == 0) {
            // wrote to empty object - simply update size and write whole page
            objix_hdr->size = offset + written;
            SPIFFS_DBG("append: %04x store fresh objix_hdr page, %04x:%04x, written %i\n", fd->obj_id, cur_objix_pix,
                       cur_objix_spix, written);

            res2 = spiffs_page_index_check(fs, fd, cur_objix_pix, cur_objix_spix);
            SPIFFS_CHECK_RES(res2);

            res2 = _spiffs_wr(fs, SPIFFS_OP_T_OBJ_IX | SPIFFS_OP_C_UPDT,
                              fd->file_nbr, SPIFFS_PAGE_TO_PADDR(fs, cur_objix_pix), SPIFFS_CFG_LOG_PAGE_SZ(fs),
                              fs->work);
            SPIFFS_CHECK_RES(res2);
            // callback on object index update
            spiffs_cb_object_event(fs, fd, SPIFFS_EV_IX_UPD, fd->obj_id, objix_hdr->p_hdr.span_ix, cur_objix_pix,
                                   objix_hdr->size);
        } else {
            // modifying object index header page, update size and make new copy
            res2 = spiffs_object_update_index_hdr(fs, fd, fd->obj_id,
                                                  fd->objix_hdr_pix, fs->work, 0, offset + written,
                                                  &new_objix_hdr_page);
            SPIFFS_DBG("append: %04x store modified objix_hdr page, %04x:%04x, written %i\n", fd->obj_id,
                       new_objix_hdr_page, 0, written);
            SPIFFS_CHECK_RES(res2);
        }
    }

    return res;
}

// Modify object
// keep current object index (header) page in fs->work buffer
int32_t spiffs_object_modify(spiffs_fd *fd, u32_t offset, uint8_t *data, u32_t len) {
    spiffs *fs = fd->fs;
    int32_t res = SPIFFS_OK;
    u32_t written = 0;

    res = spiffs_gc_check(fs, len + SPIFFS_DATA_PAGE_SIZE(fs));
    SPIFFS_CHECK_RES(res);

