niclash/forthright/arch/esp8266/spiffs/spiffs_nucleus.c
        // delete original data page
        res = spiffs_page_delete(fs, orig_data_pix);
        if (res != SPIFFS_OK) break;
        // update memory representation of object index page with new data page
        if (cur_objix_spix == 0) {
            // update object index header page
            ((spiffs_page_ix *) ((uint8_t *) objix_hdr + sizeof(spiffs_page_object_ix_header)))[data_spix] = data_pix;
            SPIFFS_DBG("modify: wrote page %04x to objix_hdr entry %02x in mem\n", data_pix, data_spix);
        } else {
            // update object index page
            ((spiffs_page_ix *) ((uint8_t *) objix + sizeof(spiffs_page_object_ix)))[SPIFFS_OBJ_IX_ENTRY(fs,
                                                                                                      data_spix)] = data_pix;
            SPIFFS_DBG("modify: wrote page %04x to objix entry %02x in mem\n", data_pix,
                       SPIFFS_OBJ_IX_ENTRY(fs, data_spix));
        }

        // update internals
        page_offs = 0;
        data_spix++;
        written += to_write;
    } // while all data

    fd->offset = offset + written;
    fd->cursor_objix_pix = cur_objix_pix;
    fd->cursor_objix_spix = cur_objix_spix;

    // finalize updated object indices
    int32_t res2 = SPIFFS_OK;
    if (cur_objix_spix != 0) {
        // wrote beyond object index header page
        // write last modified object index page
        // move and update page
        spiffs_page_ix new_objix_pix;

        res2 = spiffs_page_index_check(fs, fd, cur_objix_pix, cur_objix_spix);
        SPIFFS_CHECK_RES(res2);

        res2 = spiffs_page_move(fs, fd->file_nbr, (uint8_t *) objix, fd->obj_id, 0, cur_objix_pix, &new_objix_pix);
        SPIFFS_DBG("modify: store modified objix page, %04x:%04x, written %i\n", new_objix_pix, cur_objix_spix,
                   written);
        fd->cursor_objix_pix = new_objix_pix;
        fd->cursor_objix_spix = cur_objix_spix;
        SPIFFS_CHECK_RES(res2);
        spiffs_cb_object_event(fs, fd, SPIFFS_EV_IX_UPD, fd->obj_id, objix->p_hdr.span_ix, new_objix_pix, 0);

    } else {
        // wrote within object index header page
        res2 = spiffs_object_update_index_hdr(fs, fd, fd->obj_id,
                                              fd->objix_hdr_pix, fs->work, 0, 0, &new_objix_hdr_pix);
        SPIFFS_DBG("modify: store modified objix_hdr page, %04x:%04x, written %i\n", new_objix_hdr_pix, 0, written);
        SPIFFS_CHECK_RES(res2);
    }

    return res;
}

static int32_t spiffs_object_find_object_index_header_by_name_v(
        spiffs *fs,
        spiffs_obj_id obj_id,
        spiffs_block_ix bix,
        int ix_entry,
        u32_t user_data,
        void *user_p) {
    (void) user_data;
    int32_t res;
    spiffs_page_object_ix_header objix_hdr;
    spiffs_page_ix pix = SPIFFS_OBJ_LOOKUP_ENTRY_TO_PIX(fs, bix, ix_entry);
    if (obj_id == SPIFFS_OBJ_ID_FREE || obj_id == SPIFFS_OBJ_ID_DELETED ||
        (obj_id & SPIFFS_OBJ_ID_IX_FLAG) == 0) {
        return SPIFFS_VIS_COUNTINUE;
    }
    res = _spiffs_rd(fs, SPIFFS_OP_T_OBJ_LU2 | SPIFFS_OP_C_READ,
                     0, SPIFFS_PAGE_TO_PADDR(fs, pix), sizeof(spiffs_page_object_ix_header), (uint8_t *) &objix_hdr);
    SPIFFS_CHECK_RES(res);
    if (objix_hdr.p_hdr.span_ix == 0 &&
        (objix_hdr.p_hdr.flags & (SPIFFS_PH_FLAG_DELET | SPIFFS_PH_FLAG_FINAL | SPIFFS_PH_FLAG_IXDELE)) ==
        (SPIFFS_PH_FLAG_DELET | SPIFFS_PH_FLAG_IXDELE)) {
        if (strcmp((char *) user_p, (char *) objix_hdr.name) == 0) {
            return SPIFFS_OK;
        }
    }

    return SPIFFS_VIS_COUNTINUE;
}

// Finds object index header page by name
int32_t spiffs_object_find_object_index_header_by_name(
        spiffs *fs,
        uint8_t name[SPIFFS_OBJ_NAME_LEN],
        spiffs_page_ix *pix) {
    int32_t res;
    spiffs_block_ix bix;
    int entry;

    res = spiffs_obj_lu_find_entry_visitor(fs,
                                           fs->cursor_block_ix,
                                           fs->cursor_obj_lu_entry,
                                           0,
                                           0,
                                           spiffs_object_find_object_index_header_by_name_v,
                                           0,
                                           name,
                                           &bix,
                                           &entry);

    if (res == SPIFFS_VIS_END) {
        res = SPIFFS_ERR_NOT_FOUND;
    }
    SPIFFS_CHECK_RES(res);

    if (pix) {
        *pix = SPIFFS_OBJ_LOOKUP_ENTRY_TO_PIX(fs, bix, entry);
    }

    fs->cursor_block_ix = bix;
    fs->cursor_obj_lu_entry = entry;

    return res;
}

// Truncates object to new size. If new size is null, object may be removed totally
int32_t spiffs_object_truncate(
        spiffs_fd *fd,
        u32_t new_size,
        uint8_t remove) {
    int32_t res = SPIFFS_OK;
    spiffs *fs = fd->fs;

    res = spiffs_gc_check(fs, remove ? 0 : SPIFFS_DATA_PAGE_SIZE(fs));
    SPIFFS_CHECK_RES(res);

    spiffs_page_ix objix_pix = fd->objix_hdr_pix;
    spiffs_span_ix data_spix = (fd->size > 0 ? fd->size - 1 : 0) / SPIFFS_DATA_PAGE_SIZE(fs);
    u32_t cur_size = fd->size == (u32_t) SPIFFS_UNDEFINED_LEN ? 0 : fd->size;
    spiffs_span_ix cur_objix_spix = 0;
    spiffs_span_ix prev_objix_spix = (spiffs_span_ix) -1;
    spiffs_page_object_ix_header *objix_hdr = (spiffs_page_object_ix_header *) fs->work;
    spiffs_page_object_ix *objix = (spiffs_page_object_ix *) fs->work;
    spiffs_page_ix data_pix;
    spiffs_page_ix new_objix_hdr_pix;

    // before truncating, check if object is to be fully removed and mark this
    if (remove && new_size == 0) {
        uint8_t flags = ~(SPIFFS_PH_FLAG_USED | SPIFFS_PH_FLAG_INDEX | SPIFFS_PH_FLAG_FINAL | SPIFFS_PH_FLAG_IXDELE);
        res = _spiffs_wr(fs, SPIFFS_OP_T_OBJ_IX | SPIFFS_OP_C_UPDT,
                         fd->file_nbr,
                         SPIFFS_PAGE_TO_PADDR(fs, fd->objix_hdr_pix) + offsetof(spiffs_page_header, flags),
                         sizeof(uint8_t),
                         (uint8_t *) &flags);
        SPIFFS_CHECK_RES(res);
    }

    // delete from end of object until desired len is reached
    while (cur_size > new_size) {
        cur_objix_spix = SPIFFS_OBJ_IX_ENTRY_SPAN_IX(fs, data_spix);

        // put object index for current data span index in work buffer
        if (prev_objix_spix != cur_objix_spix) {
            if (prev_objix_spix != (spiffs_span_ix) -1) {
                // remove previous object index page
                SPIFFS_DBG("truncate: delete objix page %04x:%04x\n", objix_pix, prev_objix_spix);

