niclash/forthright/arch/esp8266/spiffs/spiffs_nucleus.c
                res = spiffs_page_index_check(fs, fd, objix_pix, prev_objix_spix);
                SPIFFS_CHECK_RES(res);

                res = spiffs_page_delete(fs, objix_pix);
                SPIFFS_CHECK_RES(res);
                spiffs_cb_object_event(fs, fd, SPIFFS_EV_IX_DEL, fd->obj_id, objix->p_hdr.span_ix, objix_pix, 0);
                if (prev_objix_spix > 0) {
                    // update object index header page
                    SPIFFS_DBG("truncate: update objix hdr page %04x:%04x to size %i\n", fd->objix_hdr_pix,
                               prev_objix_spix, cur_size);
                    res = spiffs_object_update_index_hdr(fs, fd, fd->obj_id,
                                                         fd->objix_hdr_pix, 0, 0, cur_size, &new_objix_hdr_pix);
                    SPIFFS_CHECK_RES(res);
                    fd->size = cur_size;
                }
            }
            // load current object index (header) page
            if (cur_objix_spix == 0) {
                objix_pix = fd->objix_hdr_pix;
            } else {
                res = spiffs_obj_lu_find_id_and_span(fs, fd->obj_id | SPIFFS_OBJ_ID_IX_FLAG, cur_objix_spix, 0,
                                                     &objix_pix);
                SPIFFS_CHECK_RES(res);
            }

            SPIFFS_DBG("truncate: load objix page %04x:%04x for data spix:%04x\n", objix_pix, cur_objix_spix,
                       data_spix);
            res = _spiffs_rd(fs, SPIFFS_OP_T_OBJ_IX | SPIFFS_OP_C_READ,
                             fd->file_nbr, SPIFFS_PAGE_TO_PADDR(fs, objix_pix), SPIFFS_CFG_LOG_PAGE_SZ(fs), fs->work);
            SPIFFS_CHECK_RES(res);
            SPIFFS_VALIDATE_OBJIX(objix_hdr->p_hdr, fd->obj_id, cur_objix_spix);
            fd->cursor_objix_pix = objix_pix;
            fd->cursor_objix_spix = cur_objix_spix;
            fd->offset = cur_size;

            prev_objix_spix = cur_objix_spix;
        }

        if (cur_objix_spix == 0) {
            // get data page from object index header page
            data_pix = ((spiffs_page_ix *) ((uint8_t *) objix_hdr + sizeof(spiffs_page_object_ix_header)))[data_spix];
            ((spiffs_page_ix *) ((uint8_t *) objix_hdr +
                                 sizeof(spiffs_page_object_ix_header)))[data_spix] = SPIFFS_OBJ_ID_FREE;
        } else {
            // get data page from object index page
            data_pix = ((spiffs_page_ix *) ((uint8_t *) objix + sizeof(spiffs_page_object_ix)))[SPIFFS_OBJ_IX_ENTRY(fs,
                                                                                                                 data_spix)];
            ((spiffs_page_ix *) ((uint8_t *) objix + sizeof(spiffs_page_object_ix)))[SPIFFS_OBJ_IX_ENTRY(fs,
                                                                                                      data_spix)] = SPIFFS_OBJ_ID_FREE;
        }

        SPIFFS_DBG("truncate: got data pix %04x\n", data_pix);

        if (cur_size - SPIFFS_DATA_PAGE_SIZE(fs) >= new_size) {
            // delete full data page
            res = spiffs_page_data_check(fs, fd, data_pix, data_spix);
            if (res != SPIFFS_ERR_DELETED && res != SPIFFS_OK && res != SPIFFS_ERR_INDEX_REF_FREE) {
                SPIFFS_DBG("truncate: err validating data pix %i\n", res);
                break;
            }

            if (res == SPIFFS_OK) {
                res = spiffs_page_delete(fs, data_pix);
                if (res != SPIFFS_OK) {
                    SPIFFS_DBG("truncate: err deleting data pix %i\n", res);
                    break;
                }
            } else if (res == SPIFFS_ERR_DELETED || res == SPIFFS_ERR_INDEX_REF_FREE) {
                res = SPIFFS_OK;
            }

            // update current size
            if (cur_size % SPIFFS_DATA_PAGE_SIZE(fs) == 0) {
                cur_size -= SPIFFS_DATA_PAGE_SIZE(fs);
            } else {
                cur_size -= cur_size % SPIFFS_DATA_PAGE_SIZE(fs);
            }
            fd->size = cur_size;
            fd->offset = cur_size;
            SPIFFS_DBG("truncate: delete data page %04x for data spix:%04x, cur_size:%i\n", data_pix, data_spix,
                       cur_size);
        } else {
            // delete last page, partially
            spiffs_page_header p_hdr;
            spiffs_page_ix new_data_pix;
            u32_t bytes_to_remove = SPIFFS_DATA_PAGE_SIZE(fs) - (new_size % SPIFFS_DATA_PAGE_SIZE(fs));
            SPIFFS_DBG("truncate: delete %i bytes from data page %04x for data spix:%04x, cur_size:%i\n",
                       bytes_to_remove, data_pix, data_spix, cur_size);

            res = spiffs_page_data_check(fs, fd, data_pix, data_spix);
            if (res != SPIFFS_OK) break;

            p_hdr.obj_id = fd->obj_id & ~SPIFFS_OBJ_ID_IX_FLAG;
            p_hdr.span_ix = data_spix;
            p_hdr.flags = 0xff;
            // allocate new page and copy unmodified data
            res = spiffs_page_allocate_data(fs, fd->obj_id & ~SPIFFS_OBJ_ID_IX_FLAG,
                                            &p_hdr, 0, 0, 0, 0, &new_data_pix);
            if (res != SPIFFS_OK) break;
            res = spiffs_phys_cpy(fs, 0,
                                  SPIFFS_PAGE_TO_PADDR(fs, new_data_pix) + sizeof(spiffs_page_header),
                                  SPIFFS_PAGE_TO_PADDR(fs, data_pix) + sizeof(spiffs_page_header),
                                  SPIFFS_DATA_PAGE_SIZE(fs) - bytes_to_remove);
            if (res != SPIFFS_OK) break;
            // delete original data page
            res = spiffs_page_delete(fs, data_pix);
            if (res != SPIFFS_OK) break;
            p_hdr.flags &= ~SPIFFS_PH_FLAG_FINAL;
            res = _spiffs_wr(fs, SPIFFS_OP_T_OBJ_DA | SPIFFS_OP_C_UPDT,
                             fd->file_nbr,
                             SPIFFS_PAGE_TO_PADDR(fs, new_data_pix) + offsetof(spiffs_page_header, flags),
                             sizeof(uint8_t),
                             (uint8_t *) &p_hdr.flags);
            if (res != SPIFFS_OK) break;

