niclash/forthright/arch/esp8266/spiffs/spiffs_nucleus.c
            // update memory representation of object index page with new data page
            if (cur_objix_spix == 0) {
                // update object index header page
                ((spiffs_page_ix *) ((uint8_t *) objix_hdr +
                                     sizeof(spiffs_page_object_ix_header)))[data_spix] = new_data_pix;
                SPIFFS_DBG("truncate: wrote page %04x to objix_hdr entry %02x in mem\n", new_data_pix,
                           SPIFFS_OBJ_IX_ENTRY(fs, data_spix));
            } else {
                // update object index page
                ((spiffs_page_ix *) ((uint8_t *) objix + sizeof(spiffs_page_object_ix)))[SPIFFS_OBJ_IX_ENTRY(fs,
                                                                                                          data_spix)] = new_data_pix;
                SPIFFS_DBG("truncate: wrote page %04x to objix entry %02x in mem\n", new_data_pix,
                           SPIFFS_OBJ_IX_ENTRY(fs, data_spix));
            }
            cur_size = new_size;
            fd->size = new_size;
            fd->offset = cur_size;
            break;
        }
        data_spix--;
    } // while all data

    // update object indices
    if (cur_objix_spix == 0) {
        // update object index header page
        if (cur_size == 0) {
            if (remove) {
                // remove object altogether
                SPIFFS_DBG("truncate: remove object index header page %04x\n", objix_pix);

                res = spiffs_page_index_check(fs, fd, objix_pix, 0);
                SPIFFS_CHECK_RES(res);

                res = spiffs_page_delete(fs, objix_pix);
                SPIFFS_CHECK_RES(res);
                spiffs_cb_object_event(fs, fd, SPIFFS_EV_IX_DEL, fd->obj_id, 0, objix_pix, 0);
            } else {
                // make uninitialized object
                SPIFFS_DBG("truncate: reset objix_hdr page %04x\n", objix_pix);
                memset(fs->work + sizeof(spiffs_page_object_ix_header), 0xff,
                       SPIFFS_CFG_LOG_PAGE_SZ(fs) - sizeof(spiffs_page_object_ix_header));
                res = spiffs_object_update_index_hdr(fs, fd, fd->obj_id,
                                                     objix_pix, fs->work, 0, SPIFFS_UNDEFINED_LEN, &new_objix_hdr_pix);
                SPIFFS_CHECK_RES(res);
            }
        } else {
            // update object index header page
            SPIFFS_DBG("truncate: update object index header page with indices and size\n");
            res = spiffs_object_update_index_hdr(fs, fd, fd->obj_id,
                                                 objix_pix, fs->work, 0, cur_size, &new_objix_hdr_pix);
            SPIFFS_CHECK_RES(res);
        }
    } else {
        // update both current object index page and object index header page
        spiffs_page_ix new_objix_pix;

        res = spiffs_page_index_check(fs, fd, objix_pix, cur_objix_spix);
        SPIFFS_CHECK_RES(res);

        // move and update object index page
        res = spiffs_page_move(fs, fd->file_nbr, (uint8_t *) objix_hdr, fd->obj_id, 0, objix_pix, &new_objix_pix);
        SPIFFS_CHECK_RES(res);
        spiffs_cb_object_event(fs, fd, SPIFFS_EV_IX_UPD, fd->obj_id, objix->p_hdr.span_ix, new_objix_pix, 0);
        SPIFFS_DBG("truncate: store modified objix page, %04x:%04x\n", new_objix_pix, cur_objix_spix);
        fd->cursor_objix_pix = new_objix_pix;
        fd->cursor_objix_spix = cur_objix_spix;
        fd->offset = cur_size;
        // update object index header page with new size
        res = spiffs_object_update_index_hdr(fs, fd, fd->obj_id,
                                             fd->objix_hdr_pix, 0, 0, cur_size, &new_objix_hdr_pix);
        SPIFFS_CHECK_RES(res);
    }
    fd->size = cur_size;

    return res;
}

int32_t spiffs_object_read(
        spiffs_fd *fd,
        u32_t offset,
        u32_t len,
        uint8_t *dst) {
    int32_t res = SPIFFS_OK;
    spiffs *fs = fd->fs;
    spiffs_page_ix objix_pix;
    spiffs_page_ix data_pix;
    spiffs_span_ix data_spix = offset / SPIFFS_DATA_PAGE_SIZE(fs);
    u32_t cur_offset = offset;
    spiffs_span_ix cur_objix_spix;
    spiffs_span_ix prev_objix_spix = (spiffs_span_ix) -1;
    spiffs_page_object_ix_header *objix_hdr = (spiffs_page_object_ix_header *) fs->work;
    spiffs_page_object_ix *objix = (spiffs_page_object_ix *) fs->work;

    while (cur_offset < offset + len) {
        cur_objix_spix = SPIFFS_OBJ_IX_ENTRY_SPAN_IX(fs, data_spix);
        if (prev_objix_spix != cur_objix_spix) {
            // load current object index (header) page
            if (cur_objix_spix == 0) {
                objix_pix = fd->objix_hdr_pix;
            } else {
                SPIFFS_DBG("read: find objix %04x:%04x\n", fd->obj_id, cur_objix_spix);
                res = spiffs_obj_lu_find_id_and_span(fs, fd->obj_id | SPIFFS_OBJ_ID_IX_FLAG, cur_objix_spix, 0,
                                                     &objix_pix);
                SPIFFS_CHECK_RES(res);
            }
            SPIFFS_DBG("read: load objix page %04x:%04x for data spix:%04x\n", objix_pix, cur_objix_spix, data_spix);
            res = _spiffs_rd(fs, SPIFFS_OP_T_OBJ_IX | SPIFFS_OP_C_READ,
                             fd->file_nbr, SPIFFS_PAGE_TO_PADDR(fs, objix_pix), SPIFFS_CFG_LOG_PAGE_SZ(fs), fs->work);
            SPIFFS_CHECK_RES(res);
            SPIFFS_VALIDATE_OBJIX(objix->p_hdr, fd->obj_id, cur_objix_spix);

            fd->offset = cur_offset;
            fd->cursor_objix_pix = objix_pix;
            fd->cursor_objix_spix = cur_objix_spix;

            prev_objix_spix = cur_objix_spix;
        }

        if (cur_objix_spix == 0) {
            // get data page from object index header page
            data_pix = ((spiffs_page_ix *) ((uint8_t *) objix_hdr + sizeof(spiffs_page_object_ix_header)))[data_spix];
        } else {
            // get data page from object index page
            data_pix = ((spiffs_page_ix *) ((uint8_t *) objix + sizeof(spiffs_page_object_ix)))[SPIFFS_OBJ_IX_ENTRY(fs,
                                                                                                                 data_spix)];
        }

        // all remaining data
        u32_t len_to_read = offset + len - cur_offset;
        // remaining data in page
        len_to_read = MIN(len_to_read, SPIFFS_DATA_PAGE_SIZE(fs) - (cur_offset % SPIFFS_DATA_PAGE_SIZE(fs)));
        // remaining data in file
        len_to_read = MIN(len_to_read, fd->size);
        SPIFFS_DBG("read: offset:%i rd:%i data spix:%04x is data_pix:%04x addr:%08x\n", cur_offset, len_to_read,
                   data_spix, data_pix,
                   SPIFFS_PAGE_TO_PADDR(fs, data_pix) + sizeof(spiffs_page_header) +
                   (cur_offset % SPIFFS_DATA_PAGE_SIZE(fs)));
        if (len_to_read <= 0) {
            res = SPIFFS_ERR_END_OF_OBJECT;
            break;
        }
        res = spiffs_page_data_check(fs, fd, data_pix, data_spix);
        SPIFFS_CHECK_RES(res);
        res = _spiffs_rd(
                fs, SPIFFS_OP_T_OBJ_DA | SPIFFS_OP_C_READ,
                fd->file_nbr,
                SPIFFS_PAGE_TO_PADDR(fs, data_pix) + sizeof(spiffs_page_header) +
                (cur_offset % SPIFFS_DATA_PAGE_SIZE(fs)),
                len_to_read,
                dst);
        SPIFFS_CHECK_RES(res);
        dst += len_to_read;
        cur_offset += len_to_read;
        fd->offset = cur_offset;
        data_spix++;
    }

    return res;
}

