niclash/forthright/arch/esp8266/spiffs/spiffs_nucleus.c
typedef struct {
    spiffs_obj_id min_obj_id;
    spiffs_obj_id max_obj_id;
    u32_t compaction;
    const uint8_t *conflicting_name;
} spiffs_free_obj_id_state;

static int32_t spiffs_obj_lu_find_free_obj_id_bitmap_v(spiffs *fs, spiffs_obj_id id, spiffs_block_ix bix, int ix_entry,
                                                     u32_t user_data, void *user_p) {
    if (id != SPIFFS_OBJ_ID_FREE && id != SPIFFS_OBJ_ID_DELETED) {
        spiffs_obj_id min_obj_id = user_data;
        uint8_t *conflicting_name = (uint8_t *) user_p;

        // if conflicting name parameter is given, also check if this name is found in object index hdrs
        if (conflicting_name && (id & SPIFFS_OBJ_ID_IX_FLAG)) {
            spiffs_page_ix pix = SPIFFS_OBJ_LOOKUP_ENTRY_TO_PIX(fs, bix, ix_entry);
            int res;
            spiffs_page_object_ix_header objix_hdr;
            res = _spiffs_rd(fs, SPIFFS_OP_T_OBJ_LU2 | SPIFFS_OP_C_READ,
                             0, SPIFFS_PAGE_TO_PADDR(fs, pix), sizeof(spiffs_page_object_ix_header),
                             (uint8_t *) &objix_hdr);
            SPIFFS_CHECK_RES(res);
            if (objix_hdr.p_hdr.span_ix == 0 &&
                (objix_hdr.p_hdr.flags & (SPIFFS_PH_FLAG_DELET | SPIFFS_PH_FLAG_FINAL | SPIFFS_PH_FLAG_IXDELE)) ==
                (SPIFFS_PH_FLAG_DELET | SPIFFS_PH_FLAG_IXDELE)) {
                if (strcmp((char *) user_p, (char *) objix_hdr.name) == 0) {
                    return SPIFFS_ERR_CONFLICTING_NAME;
                }
            }
        }

        id &= ~SPIFFS_OBJ_ID_IX_FLAG;
        u32_t bit_ix = (id - min_obj_id) & 7;
        int byte_ix = (id - min_obj_id) >> 3;
        if (byte_ix >= 0 && (u32_t) byte_ix < SPIFFS_CFG_LOG_PAGE_SZ(fs)) {
            fs->work[byte_ix] |= (1 << bit_ix);
        }
    }
    return SPIFFS_VIS_COUNTINUE;
}

static int32_t spiffs_obj_lu_find_free_obj_id_compact_v(spiffs *fs, spiffs_obj_id id, spiffs_block_ix bix, int ix_entry,
                                                      u32_t user_data, void *user_p) {
    (void) user_data;
    if (id != SPIFFS_OBJ_ID_FREE && id != SPIFFS_OBJ_ID_DELETED && (id & SPIFFS_OBJ_ID_IX_FLAG)) {
        int32_t res;
        spiffs_free_obj_id_state *state = (spiffs_free_obj_id_state *) user_p;
        spiffs_page_object_ix_header objix_hdr;

        res = _spiffs_rd(fs, SPIFFS_OP_T_OBJ_LU2 | SPIFFS_OP_C_READ,
                         0, SPIFFS_OBJ_LOOKUP_ENTRY_TO_PADDR(fs, bix, ix_entry), sizeof(spiffs_page_object_ix_header),
                         (uint8_t *) &objix_hdr);
        if (res == SPIFFS_OK && objix_hdr.p_hdr.span_ix == 0 &&
            ((objix_hdr.p_hdr.flags & (SPIFFS_PH_FLAG_INDEX | SPIFFS_PH_FLAG_FINAL | SPIFFS_PH_FLAG_DELET)) ==
             (SPIFFS_PH_FLAG_DELET))) {
            // ok object look up entry
            if (state->conflicting_name &&
                strcmp((const char *) state->conflicting_name, (char *) objix_hdr.name) == 0) {
                return SPIFFS_ERR_CONFLICTING_NAME;
            }

            id &= ~SPIFFS_OBJ_ID_IX_FLAG;
            if (id >= state->min_obj_id && id <= state->max_obj_id) {
                uint8_t *map = (uint8_t *) fs->work;
                int ix = (id - state->min_obj_id) / state->compaction;
                //SPIFFS_DBG("free_obj_id: add ix %i for id %04x min:%04x max%04x comp:%i\n", ix, id, state->min_obj_id, state->max_obj_id, state->compaction);
                map[ix]++;
            }
        }
    }
    return SPIFFS_VIS_COUNTINUE;
}

// Scans thru all object lookup for object index header pages. If total possible number of
// object ids cannot fit into a work buffer, these are grouped. When a group containing free
// object ids is found, the object lu is again scanned for object ids within group and bitmasked.
// Finally, the bitmasked is searched for a free id
int32_t spiffs_obj_lu_find_free_obj_id(spiffs *fs, spiffs_obj_id *obj_id, uint8_t *conflicting_name) {
    int32_t res = SPIFFS_OK;
    u32_t max_objects = (SPIFFS_CFG_PHYS_SZ(fs) / (u32_t) SPIFFS_CFG_LOG_PAGE_SZ(fs)) / 2;
    spiffs_free_obj_id_state state;
    spiffs_obj_id free_obj_id = SPIFFS_OBJ_ID_FREE;
    state.min_obj_id = 1;
    state.max_obj_id = max_objects + 1;
    if (state.max_obj_id & SPIFFS_OBJ_ID_IX_FLAG) {
        state.max_obj_id = ((spiffs_obj_id) -1) & ~SPIFFS_OBJ_ID_IX_FLAG;
    }
    state.compaction = 0;
    state.conflicting_name = conflicting_name;
    while (res == SPIFFS_OK && free_obj_id == SPIFFS_OBJ_ID_FREE) {
        if (state.max_obj_id - state.min_obj_id <= (spiffs_obj_id) SPIFFS_CFG_LOG_PAGE_SZ(fs) * 8) {
            // possible to represent in bitmap
            u32_t i, j;
            SPIFFS_DBG("free_obj_id: BITM min:%04x max:%04x\n", state.min_obj_id, state.max_obj_id);

            memset(fs->work, 0, SPIFFS_CFG_LOG_PAGE_SZ(fs));
            res = spiffs_obj_lu_find_entry_visitor(fs, 0, 0, 0, 0, spiffs_obj_lu_find_free_obj_id_bitmap_v,
                                                   state.min_obj_id,
                                                   conflicting_name, 0, 0);
            if (res == SPIFFS_VIS_END) res = SPIFFS_OK;
            SPIFFS_CHECK_RES(res);
            // traverse bitmask until found free obj_id
            for (i = 0; i < SPIFFS_CFG_LOG_PAGE_SZ(fs); i++) {
                uint8_t mask = fs->work[i];
                if (mask == 0xff) {
                    continue;
                }
                for (j = 0; j < 8; j++) {
                    if ((mask & (1 << j)) == 0) {
                        *obj_id = (i << 3) + j + state.min_obj_id;
                        return SPIFFS_OK;
                    }
                }
            }
            return SPIFFS_ERR_FULL;
        } else {
            // not possible to represent all ids in range in a bitmap, compact and count
            if (state.compaction != 0) {
                // select element in compacted table, decrease range and recompact
                u32_t i, min_i = 0;
                uint8_t *map = (uint8_t *) fs->work;
                uint8_t min_count = 0xff;

                for (i = 0; i < SPIFFS_CFG_LOG_PAGE_SZ(fs) / sizeof(uint8_t); i++) {
                    if (map[i] < min_count) {
                        min_count = map[i];
                        min_i = i;
                        if (min_count == 0) {
                            break;
                        }
                    }
                }

                if (min_count == state.compaction) {
                    // there are no free objids!
                    SPIFFS_DBG("free_obj_id: compacted table is full\n");
                    return SPIFFS_ERR_FULL;
                }

                SPIFFS_DBG("free_obj_id: COMP select index:%i min_count:%i min:%04x max:%04x compact:%i\n", min_i,
                           min_count, state.min_obj_id, state.max_obj_id, state.compaction);

                if (min_count == 0) {
                    // no id in this range, skip compacting and use directly
                    *obj_id = min_i * state.compaction + state.min_obj_id;
                    return SPIFFS_OK;
                } else {
                    SPIFFS_DBG("free_obj_id: COMP SEL chunk:%04x min:%04x -> %04x\n", state.compaction,
                               state.min_obj_id, state.min_obj_id + min_i * state.compaction);
                    state.min_obj_id += min_i * state.compaction;
                    state.max_obj_id = state.min_obj_id + state.compaction;
                    // decrease compaction
                }
                if ((state.max_obj_id - state.min_obj_id <= (spiffs_obj_id) SPIFFS_CFG_LOG_PAGE_SZ(fs) * 8)) {
                    // no need for compacting, use bitmap
                    continue;
                }
            }
            // in a work memory of log_page_size bytes, we may fit in log_page_size ids
            // todo what if compaction is > 255 - then we cannot fit it in a byte
            state.compaction = (state.max_obj_id - state.min_obj_id) / ((SPIFFS_CFG_LOG_PAGE_SZ(fs) / sizeof(uint8_t)));
            SPIFFS_DBG("free_obj_id: COMP min:%04x max:%04x compact:%i\n", state.min_obj_id, state.max_obj_id,
                       state.compaction);

            memset(fs->work, 0, SPIFFS_CFG_LOG_PAGE_SZ(fs));
            res = spiffs_obj_lu_find_entry_visitor(fs, 0, 0, 0, 0, spiffs_obj_lu_find_free_obj_id_compact_v, 0, &state,
                                                   0, 0);
            if (res == SPIFFS_VIS_END) res = SPIFFS_OK;
            SPIFFS_CHECK_RES(res);
            state.conflicting_name = 0; // searched for conflicting name once, no need to do it again
        }
    }

    return res;
}

int32_t spiffs_fd_find_new(spiffs *fs, spiffs_fd **fd) {
    u32_t i;
    spiffs_fd *fds = (spiffs_fd *) fs->fd_space;
    for (i = 0; i < fs->fd_count; i++) {
        spiffs_fd *cur_fd = &fds[i];
        if (cur_fd->file_nbr == 0) {
            cur_fd->file_nbr = i + 1;
            *fd = cur_fd;
            return SPIFFS_OK;
        }
    }
    return SPIFFS_ERR_OUT_OF_FILE_DESCS;
}

int32_t spiffs_fd_return(spiffs *fs, spiffs_file f) {
    if (f <= 0 || f > (s16_t) fs->fd_count) {
        return SPIFFS_ERR_BAD_DESCRIPTOR;
    }
    spiffs_fd *fds = (spiffs_fd *) fs->fd_space;
    spiffs_fd *fd = &fds[f - 1];
    if (fd->file_nbr == 0) {
        return SPIFFS_ERR_FILE_CLOSED;
    }
    fd->file_nbr = 0;
    return SPIFFS_OK;
}

int32_t spiffs_fd_get(spiffs *fs, spiffs_file f, spiffs_fd **fd) {
    if (f <= 0 || f > (s16_t) fs->fd_count) {
        return SPIFFS_ERR_BAD_DESCRIPTOR;
    }
    spiffs_fd *fds = (spiffs_fd *) fs->fd_space;
    *fd = &fds[f - 1];
    if ((*fd)->file_nbr == 0) {
        return SPIFFS_ERR_FILE_CLOSED;
    }
    return SPIFFS_OK;
}
